In [1]:
import numpy as np
import pandas as pd

In [4]:
index = [('California', 2000), ('California', 2010),
         ('New York', 2000), ('New York', 2010),
         ('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
               18976457, 19378102,
               20851820, 25145561]
index = pd.MultiIndex.from_tuples(index)
pop = pd.Series(populations, index=index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [5]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [6]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [7]:
type(pop)

pandas.core.series.Series

In [8]:
pop_df = pop.unstack?

In [22]:
pop_df = pop.unstack(level=-1)
pop_df
#type(pop_df)

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [19]:
pop_df.stack?

In [23]:
pop_df.stack(level=0)

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [24]:
pop_df = pd.DataFrame({'total': pop,
                       'under18': [9267089, 9284094,
                                   4687374, 4318033,
                                   5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [31]:
f_u18 = pop_df['under18'] / pop_df['total'] *100
type(f_u18)
f_u18
f_u18.unstack(level=0)

      California   New York      Texas
2000   27.359428  24.700997  28.325110
2010   24.921096  22.283054  27.356773

In [32]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.909458  0.600020
  2  0.180130  0.070830
b 1  0.997430  0.053005
  2  0.899312  0.530172

In [33]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [34]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [49]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])
# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37
data

array([[40. , 36.7, 45. , 37. , 33. , 37.3],
       [48. , 37.1, 37. , 37.7, 35. , 36. ],
       [42. , 36.1, 37. , 37.8, 30. , 38.4],
       [34. , 36.7, 41. , 36.2, 23. , 36.5]])

In [50]:
# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      40.0  36.7  45.0  37.0  33.0  37.3
     2      48.0  37.1  37.0  37.7  35.0  36.0
2014 1      42.0  36.1  37.0  37.8  30.0  38.4
     2      34.0  36.7  41.0  36.2  23.0  36.5

In [51]:
health_data.index

MultiIndex([(2013, 1),
            (2013, 2),
            (2014, 1),
            (2014, 2)],
           names=['year', 'visit'])

In [52]:
health_data.columns

MultiIndex([(  'Bob',   'HR'),
            (  'Bob', 'Temp'),
            ('Guido',   'HR'),
            ('Guido', 'Temp'),
            (  'Sue',   'HR'),
            (  'Sue', 'Temp')],
           names=['subject', 'type'])

In [53]:
health_data.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 4 entries, (2013, 1) to (2014, 2)
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   (Bob, HR)      4 non-null      float64
 1   (Bob, Temp)    4 non-null      float64
 2   (Guido, HR)    4 non-null      float64
 3   (Guido, Temp)  4 non-null      float64
 4   (Sue, HR)      4 non-null      float64
 5   (Sue, Temp)    4 non-null      float64
dtypes: float64(6)
memory usage: 499.0 bytes

In [54]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      45.0  37.0
     2      37.0  37.7
2014 1      37.0  37.8
     2      41.0  36.2

In [55]:
pop['California', 2000]

33871648

In [56]:
pop.loc['California':'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [57]:
pop[:, 2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [58]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [59]:
pop[['California', 'Texas']]

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [60]:
health_data['Guido', 'HR']

year  visit
2013  1        45.0
      2        37.0
2014  1        37.0
      2        41.0
Name: (Guido, HR), dtype: float64

In [61]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      40.0  36.7
     2      48.0  37.1

In [62]:
index = pd.MultiIndex.from_product([['a', 'c', 'b'], [1, 2]])
data = pd.Series(np.random.rand(6), index=index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.161442
      2      0.359362
c     1      0.912157
      2      0.454198
b     1      0.466271
      2      0.998326
dtype: float64

In [63]:
data = data.sort_index()
data

char  int
a     1      0.161442
      2      0.359362
b     1      0.466271
      2      0.998326
c     1      0.912157
      2      0.454198
dtype: float64

In [64]:
data['a':'b']

char  int
a     1      0.161442
      2      0.359362
b     1      0.466271
      2      0.998326
dtype: float64

In [65]:
pop_flat = pop.reset_index(name='population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [68]:
type(pop_flat)

pandas.core.frame.DataFrame

In [70]:
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [71]:
data_mean = health_data.mean(level='year')
data_mean

subject   Bob       Guido          Sue
type       HR  Temp    HR   Temp    HR   Temp
year
2013     44.0  36.9  41.0  37.35  34.0  36.65
2014     38.0  36.4  39.0  37.00  26.5  37.45

In [73]:
data_mean.mean(axis=1, level='type')

type         HR       Temp
year
2013  39.666667  36.966667
2014  34.500000  36.950000